Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/prison_system/prison_medical_services.html.txt.tmx
Source language: en
Languages: ga

source: While someone is in prison, they can expect to be provided with medical, dental, psychiatric and psychological care
ga: Nuair atá tú sa bpríosún beidh aire leighis, fiaclach, síciatrach agus siceolaíoch curtha ar fáil

source: A Director who is a medical specialist heads the Prison Medical Service
ga: Tá stiúrthóir atá ina shainelaí leighis i gceannas ar an tseirbhís leighis sa phríosún

source: Section 35 of the Prisons Act 2007 came into effect in May 2007 and provides for the making of prison rules
ga: Tháinig Alt 35 d'Acht na bPríosún 2007 i bhfeidhm i mí Bealtaine 2007 agus soláthraíonn sé do dhéanamh rialacha príosúin

source: Prison rules set out the the various conditions in prisons in Ireland and include all aspects of admission, registration, accommodation, visiting rights, health, discipline, education, etc
ga: Leagtar amach na rialacha príosúin na coinníollacha éagsúla i bpríosúin in Éirinn agus áirítear gach gné den iontráil, clárú, cóiríocht, cearta cuairte, sláinte, smacht, oideachas, etc

source: The new Act extends the range of matters covered by prison rules
ga: Síneann an tAcht nua ar an raon de nithe atá clúdaithe ag rialacha príosúin

source: The prison rules (SI No. 252/2007) came into operation in October 2007
ga: Tháinig na rialacha príosúin (SI 252/2007) i bhfeidhm i mí Dheireadh Fómhair 2007

source: Medical doctors provide medical services in all prisons
ga: Cuireann dochtúirí leighis seirbhísí leighis ar fáil sna príosúin uilig

source: They must pay particular attention to prisoners with psychiatric problems
ga: Caithfidh siad aire speisialta a thabhairt dóibh siúd a bhfuil fadhbanna síciatrach acu

source: Professionally qualified nurses assist the prison doctors and the nurses provide 24-hour cover in closed prisons
ga: Tug banaltraí cúnamh do dochtúirí an phríosúin

source: If a prisoner needs hospital treatment, they will be transferred to outside hospitals, after a recommendation by the prison doctor
ga: Má tá cóir leighis ón ospidéal uait agus nuair atá tú molta ag dochtúir príosúin aistrófar tú chuig ospidéal ar an taobh amuigh

source: They may also be taken to local hospitals for outpatient treatment if it is required
ga: Má tá gá leis, tabharfar tú chuig ospidéal áitiúil mar othar sheachtrach

source: If someone needs psychiatric treatment while they are in prison, this will be provided by visiting psychiatrists employed by the Health Service Executive (HSE)
ga: Má tá cóir leighis síciatrach ag teastáil uait agus tú i bpríosún, tiocfaidh síciatraí ón mBord Sláinte ar cuairt chugat

source: If the psychiatrist and the prison doctor consider that you are in need of in-patient psychiatric treatment, you may be transferred to either the Central Mental Hospital or a district mental hospital
ga: Má tá an dochtúir príosúin agus an síciatraí den tuairim go bhfuil cóir leighis ospidéal uait, seans go n-aistreofar tú chuig an ospidéal meabhairghalar lárnach nó chuig an ospidéal meabhairghalr dúiche

source: Counselling and care support will also be provided after your release from prison at the HSE's day centre at Usher's Island in Dublin
ga: Tá seirbhís comhairleoireachta agus tacaíochta a sholáthar ag Bord Sláinte an Oirthear san Ionad lae atá acu in Oilean Ushers i mBaile Átha Cliath nuair a scaoiltear amach as an bpríosún tú

source: If a prisoner needs psychological treatment while in prison, it will be provided by the Psychology Service
ga: Má tá cóir siceolaíochta uait agus tú ibpríosún, cuirfear ar fáil seirbhís siceolaíochta duit

source: The main function of the Psychology Service is to provide prisoners with on-going therapy and supportive counselling
ga: Sé príomh aidhm an tseirbhís siceolaíochta na tacaíocht comhairleoireachta agus teiripe leanúnach a sholáthar duit

source: This counselling aims to increase awareness of problems and help to develop alternative strategies for dealing with criminal behaviour
ga: Sé aidhm na comhairleoireachta na tú féin a chur ar an eolas faoi do chuid fadhbanna agus cúnamh a thabhairt duit straitéisí eile a fhorbairt chun déileáil le do chuid iompar chóiriúil

source: The Psychology Service also provides a variety of programmes for sex offenders and a cognitive skills course for prisoners
ga: Cuireann an tseirbhís siceolaíochta réimse cláracha ar fáil do chiontóirí gnéis chomh maith le cúrsaí feasa do phríosúnaithe

source: Dental treatment is provided on a similar basis to that available in the general community under the Medical Card scheme
ga: Cuirtear cóir fiaclach ar fáil de réir scéim chárta leighis mar a chéile agus atá ag an gnáthphobal

source: In the Dublin prisons, dental services are provided by means of a contract arrangement with the Dublin Dental Hospital for the provision of dental staff to the prisons, while, elsewhere, local dentists provide the service
ga: I mBaile Átha Cliath tá conradh idir Ospidéal Fiaclach Bhaile Átha Cliath agus na príosúin agus da bharr cuirtear foireann fiaclach amach chuig na príosúin. 'Siad na fiaclóirí áitiúil a sholathraíonn an tseirbhís sa chuid eile den tír

source: Further information on the Prison Medical Service is available on the Prison Service website
ga: Tá tuilleadh eolais ar an tSeirbhís Phríosúin Leighis ar fáil ar láithreán gréasáin na Seirbhíse Phríosúin
